IDENTIFICATION DIVISION.
PROGRAM-ID. AddTwoNumbers.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 NUM1         PIC 9(5) VALUE 0.
   01 NUM2         PIC 9(5) VALUE 0.
   01 RESULT       PIC 9(6) VALUE 0.

PROCEDURE DIVISION.
   DISPLAY "Enter the first number: " WITH NO ADVANCING.
   ACCEPT NUM1.
   DISPLAY "Enter the second number: " WITH NO ADVANCING.
   ACCEPT NUM2.

   ADD NUM1 TO NUM2 GIVING RESULT.

   DISPLAY "The result of adding " NUM1 " and " NUM2 " is: " RESULT.

   STOP RUN.
